Assignment/Assignment5/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2021-10-03 22:44:58.721612"], ["status", "archived"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)